# DataFrame Transformations
---
- Converting one form of data into another form is called as transformation
- Example:
    - Convert usd into indian currency
    - Convert miles into KMs
    - Convert numbers into dozens
    - ... Etc

## 1. Create <code>DataFrame</code> from csv file

In [1]:
# change current working directory to where the files are available 
import os
os.chdir("C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python")
os.getcwd()

'C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python'

In [2]:
import pandas as pd
df = pd.read_csv("pandas_sales.csv",index_col="month")

In [3]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## 2. Convert all metrics into dozens (1 dozen = 12 items)
### 2.1 Method 1: using dataframe method

In [4]:
df.floordiv(12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [5]:
df.spam.floordiv(12)

month
Jan    1
Feb    2
Mar    6
Apr    1
May    4
Jun    4
Name: spam, dtype: int64

### 2.2 Method 2: Using numpy function

In [7]:
import numpy as np
np.floor_divide(df,12)

C:\Users\ramreddymyla\Anaconda3\envs\rasax\lib\site-packages\ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in floor_divide

       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    18.0   7.0   6.0
Apr     6.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

### 2.3 Method 3: User Defined function

In [8]:
def fun_dozens(x):
    return x/12

In [9]:
fun_dozens(df)

            eggs      salt      spam
month
Jan     3.916667  1.000000  1.416667
Feb     9.166667  4.166667  2.583333
Mar    18.416667  7.416667  6.000000
Apr     6.416667  7.250000  1.666667
May    11.000000       NaN  4.333333
Jun    17.083333  5.000000  4.583333

### 2.4 Method 4: Using lambda function

In [10]:
df.apply(lambda n : n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

## 3. Transform one particular column

In [11]:
df.salt.floordiv(12)

month
Jan    1.0
Feb    4.0
Mar    7.0
Apr    7.0
May    NaN
Jun    5.0
Name: salt, dtype: float64

### 4. Get indexes of df

In [12]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

## 5. Convert index names into uppercase

In [13]:
df.index.str.upper()

Index(['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'], dtype='object', name='month')

## 6. Add two columns

In [14]:
df["salt_eggs"]= df.salt + df.eggs

In [15]:
df

       eggs  salt  spam  salt_eggs
month
Jan      47  12.0    17       59.0
Feb     110  50.0    31      160.0
Mar     221  89.0    72      310.0
Apr      77  87.0    20      164.0
May     132   NaN    52        NaN
Jun     205  60.0    55      265.0